Masmiseim36/nxpSDK/middleware/mcu_bootloader/targets/MIMXRT1021/src/sdmmc_init.h
/*
 * Copyright 2017-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */
#if !defined(__SDMMC_INIT_H__)
#define __SDMMC_INIT_H__

#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#if FSL_FEATURE_SOC_PORT_COUNT
#include "fsl_port.h"
#endif
#include "bootloader_common.h"

/******************************************************************************
 * Definitions.
 *****************************************************************************/
enum
{
    kSDMMC_PWR_DOWN_20MS = 0,
    kSDMMC_PWR_DOWN_10MS = 1,
    kSDMMC_PWR_DOWN_5MS = 2,
    kSDMMC_PWR_DOWN_2D5MS = 3,

    kSDMMC_PWR_UP_5MS = 0,
    kSDMMC_PWR_UP_2D5MS = 1,
};

////////////////////////////////////////////////////////////////////////////////
// Basic Definitions
////////////////////////////////////////////////////////////////////////////////
/*! @brief USDHC base address. */
#define BOARD_USDHC1_BASEADDR USDHC1
#define BOARD_USDHC2_BASEADDR USDHC2
/*! @brief USDHC frequency. */
#define BOARD_USDHC1_CLK_FREQ (CLOCK_GetFreq(kCLOCK_SysPllPfd0Clk) / (CLOCK_GetDiv(kCLOCK_Usdhc1Div) + 1U))
#define BOARD_USDHC2_CLK_FREQ (CLOCK_GetFreq(kCLOCK_SysPllPfd0Clk) / (CLOCK_GetDiv(kCLOCK_Usdhc2Div) + 1U))
/*! @brief USDHC pin port. */
#define BOARD_USDHC1_CD_GPIO_BASE (GPIO3)
#define BOARD_USDHC1_CD_GPIO_PIN (19)
#define BOARD_USDHC1_CD_GPIO_IOMUXC IOMUXC_GPIO_SD_B0_06_USDHC1_CD_B
#define BOARD_USDHC1_CMD_IOMUXC IOMUXC_GPIO_SD_B0_02_USDHC1_CMD
#define BOARD_USDHC1_CLK_IOMUXC IOMUXC_GPIO_SD_B0_03_USDHC1_CLK
#define BOARD_USDHC1_DATA0_IOMUXC IOMUXC_GPIO_SD_B0_04_USDHC1_DATA0
#define BOARD_USDHC1_DATA1_IOMUXC IOMUXC_GPIO_SD_B0_05_USDHC1_DATA1
#define BOARD_USDHC1_DATA2_IOMUXC IOMUXC_GPIO_SD_B0_00_USDHC1_DATA2
#define BOARD_USDHC1_DATA3_IOMUXC IOMUXC_GPIO_SD_B0_01_USDHC1_DATA3
#define BOARD_USDHC1_VSELECT_IOMUXC IOMUXC_GPIO_AD_B1_07_USDHC1_VSELECT
#define BOARD_USDHC1_RESET_B_GPIO_BASE (GPIO1)
#define BOARD_USDHC1_RESET_B_GPIO_PIN (22)
#define BOARD_USDHC1_RESET_B_GPIO_IOMUXC IOMUXC_GPIO_AD_B1_06_USDHC1_RESET_B

#define BOARD_USDHC2_CD_GPIO_BASE (GPIO3)
#define BOARD_USDHC2_CD_GPIO_PIN (26)
#define BOARD_USDHC2_CD_GPIO_IOMUXC IOMUXC_GPIO_SD_B1_06_USDHC2_CD_B
#define BOARD_USDHC2_CMD_IOMUXC IOMUXC_GPIO_SD_B1_02_USDHC2_CMD
#define BOARD_USDHC2_CLK_IOMUXC IOMUXC_GPIO_SD_B1_03_USDHC2_CLK
#define BOARD_USDHC2_DATA0_IOMUXC IOMUXC_GPIO_SD_B1_04_USDHC2_DATA0
#define BOARD_USDHC2_DATA1_IOMUXC IOMUXC_GPIO_SD_B1_05_USDHC2_DATA1
#define BOARD_USDHC2_DATA2_IOMUXC IOMUXC_GPIO_SD_B1_00_USDHC2_DATA2
#define BOARD_USDHC2_DATA3_IOMUXC IOMUXC_GPIO_SD_B1_01_USDHC2_DATA3
#define BOARD_USDHC2_DATA4_IOMUXC IOMUXC_GPIO_SD_B1_08_USDHC2_DATA4
#define BOARD_USDHC2_DATA5_IOMUXC IOMUXC_GPIO_SD_B1_09_USDHC2_DATA5
#define BOARD_USDHC2_DATA6_IOMUXC IOMUXC_GPIO_SD_B1_10_USDHC2_DATA6
#define BOARD_USDHC2_DATA7_IOMUXC IOMUXC_GPIO_SD_B1_11_USDHC2_DATA7
//#define BOARD_USDHC2_VSELECT_IOMUXC IOMUXC_GPIO_EMC_38_USDHC2_VSELECT
#define BOARD_USDHC2_RESET_B_GPIO_BASE (GPIO3)
#define BOARD_USDHC2_RESET_B_GPIO_PIN (27)
#define BOARD_USDHC2_RESET_B_GPIO_IOMUXC IOMUXC_GPIO_SD_B1_07_USDHC2_RESET_B

#if BL_FEATURE_SD_MODULE && BL_FEATURE_SD_MODULE_HAS_CARD_DETECT
#if defined(BL_FEATURE_SD_MODULE_CARD_DETECT_LEVEL)
#define BOARD_USDHC_CARD_INSERT_CD_LEVEL (BL_FEATURE_SD_MODULE_CARD_DETECT_LEVEL)
#endif
#if defined(BL_FEATURE_SD_MODULE_CARD_DETECT_TIMEOUT)
#define BOARD_TIMEOUT_CARD_DETECT (BL_FEATURE_SD_MODULE_CARD_DETECT_TIMEOUT)
#else
#define BOARD_TIMEOUT_CARD_DETECT 0
#endif
#endif

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
void usdhc_power_control_init(USDHC_Type *base);
void usdhc_power_control(USDHC_Type *base, bool state);
void usdhc_vselect_init(USDHC_Type *base);

/*! @brief Power control init function. */
#define BOARD_USDHC_POWER_CONTROL_INIT(base) usdhc_power_control_init(base)
/*! @brief Power control enable/disable function. */
#define BOARD_USDHC_POWER_CONTROL(base, state) usdhc_power_control(base, state)
/*! @brief vselect function. */
#define BOARD_USDHC_VSELECT_INIT(base) usdhc_vselect_init(base)
/*! @brief CD pin init function. */
#define BOARD_USDHC_CD_INIT(base, cdType)
/*! @brief Get CD GPIO levle. */
#define BOARD_USDHC_CD_GPIO_STATUS(base) (0)
/*! @brief SD card detection pin config fucntion for KSDK, not really used */
#define BOARD_USDHC_CD_GPIO_INIT()
/*! @brief SD card detection status fucntion for KSDK, not really used */
#define BOARD_USDHC_CD_STATUS() (0)

////////////////////////////////////////////////////////////////////////////////
// Board Definitions
////////////////////////////////////////////////////////////////////////////////
#if BL_FEATURE_MMC_MODULE_PERIPHERAL_INSTANCE == 1
#define BOARD_MMC_HOST_BASEADDR BOARD_USDHC1_BASEADDR
#define BOARD_MMC_HOST_CLK_FREQ BOARD_USDHC1_CLK_FREQ
#define BOARD_MMC_CMD_IOMUXC BOARD_USDHC1_CMD_IOMUXC
#define BOARD_MMC_CLK_IOMUXC BOARD_USDHC1_CLK_IOMUXC
#define BOARD_MMC_DATA0_IOMUXC BOARD_USDHC1_DATA0_IOMUXC
#define BOARD_MMC_DATA1_IOMUXC BOARD_USDHC1_DATA1_IOMUXC
#define BOARD_MMC_DATA2_IOMUXC BOARD_USDHC1_DATA2_IOMUXC
#define BOARD_MMC_DATA3_IOMUXC BOARD_USDHC1_DATA3_IOMUXC
#define BOARD_MMC_DATA4_IOMUXC BOARD_USDHC1_DATA4_IOMUXC
#define BOARD_MMC_DATA5_IOMUXC BOARD_USDHC1_DATA5_IOMUXC
#define BOARD_MMC_DATA6_IOMUXC BOARD_USDHC1_DATA6_IOMUXC
#define BOARD_MMC_DATA7_IOMUXC BOARD_USDHC1_DATA7_IOMUXC
#define BOARD_MMC_VSELECT_IOMUXC BOARD_USDHC1_VSELECT_IOMUXC
#define BOARD_MMC_RESET_B_GPIO_BASE BOARD_USDHC1_RESET_B_GPIO_BASE
#define BOARD_MMC_RESET_B_GPIO_PIN BOARD_USDHC1_RESET_B_GPIO_PIN
#define BOARD_MMC_RESET_B_GPIO_IOMUXC BOARD_USDHC1_RESET_B_GPIO_IOMUXC
#elif BL_FEATURE_MMC_MODULE_PERIPHERAL_INSTANCE == 2
#define BOARD_MMC_HOST_BASEADDR BOARD_USDHC2_BASEADDR
#define BOARD_MMC_HOST_CLK_FREQ BOARD_USDHC2_CLK_FREQ
#define BOARD_MMC_CMD_IOMUXC BOARD_USDHC2_CMD_IOMUXC
#define BOARD_MMC_CLK_IOMUXC BOARD_USDHC2_CLK_IOMUXC
#define BOARD_MMC_DATA0_IOMUXC BOARD_USDHC2_DATA0_IOMUXC
#define BOARD_MMC_DATA1_IOMUXC BOARD_USDHC2_DATA1_IOMUXC
#define BOARD_MMC_DATA2_IOMUXC BOARD_USDHC2_DATA2_IOMUXC
#define BOARD_MMC_DATA3_IOMUXC BOARD_USDHC2_DATA3_IOMUXC
#define BOARD_MMC_DATA4_IOMUXC BOARD_USDHC2_DATA4_IOMUXC
#define BOARD_MMC_DATA5_IOMUXC BOARD_USDHC2_DATA5_IOMUXC
#define BOARD_MMC_DATA6_IOMUXC BOARD_USDHC2_DATA6_IOMUXC
#define BOARD_MMC_DATA7_IOMUXC BOARD_USDHC2_DATA7_IOMUXC
//#define BOARD_MMC_VSELECT_IOMUXC BOARD_USDHC2_VSELECT_IOMUXC
#define BOARD_MMC_RESET_B_GPIO_BASE BOARD_USDHC2_RESET_B_GPIO_BASE
#define BOARD_MMC_RESET_B_GPIO_PIN BOARD_USDHC2_RESET_B_GPIO_PIN
#define BOARD_MMC_RESET_B_GPIO_IOMUXC BOARD_USDHC2_RESET_B_GPIO_IOMUXC
#else
#define BOARD_MMC_HOST_BASEADDR
#define BOARD_MMC_HOST_CLK_FREQ
#define BOARD_MMC_CMD_IOMUXC
#define BOARD_MMC_CLK_IOMUXC
#define BOARD_MMC_DATA0_IOMUXC
#define BOARD_MMC_DATA1_IOMUXC
#define BOARD_MMC_DATA2_IOMUXC
#define BOARD_MMC_DATA3_IOMUXC
#define BOARD_MMC_DATA4_IOMUXC
#define BOARD_MMC_DATA5_IOMUXC
#define BOARD_MMC_DATA6_IOMUXC
#define BOARD_MMC_DATA7_IOMUXC
#define BOARD_MMC_VSELECT_IOMUXC
#define BOARD_MMC_RESET_B_GPIO_BASE
#define BOARD_MMC_RESET_B_GPIO_PIN
#define BOARD_MMC_RESET_B_GPIO_IOMUXC
#endif

/*! @brief SD board-level definition. */
#if BL_FEATURE_SD_MODULE_PERIPHERAL_INSTANCE == 1
#define BOARD_SD_HOST_BASEADDR BOARD_USDHC1_BASEADDR
#define BOARD_SD_HOST_CLK_FREQ BOARD_USDHC1_CLK_FREQ
#define BOARD_SD_CD_GPIO_BASE BOARD_USDHC1_CD_GPIO_BASE
#define BOARD_SD_CD_GPIO_PIN BOARD_USDHC1_CD_GPIO_PIN
#define BOARD_SD_CD_GPIO_IOMUXC BOARD_USDHC1_CD_GPIO_IOMUXC
#define BOARD_SD_CMD_IOMUXC BOARD_USDHC1_CMD_IOMUXC
#define BOARD_SD_CLK_IOMUXC BOARD_USDHC1_CLK_IOMUXC
#define BOARD_SD_DATA0_IOMUXC BOARD_USDHC1_DATA0_IOMUXC
#define BOARD_SD_DATA1_IOMUXC BOARD_USDHC1_DATA1_IOMUXC
#define BOARD_SD_DATA2_IOMUXC BOARD_USDHC1_DATA2_IOMUXC
#define BOARD_SD_DATA3_IOMUXC BOARD_USDHC1_DATA3_IOMUXC
#define BOARD_SD_VSELECT_IOMUXC BOARD_USDHC1_VSELECT_IOMUXC
#define BOARD_SD_RESET_B_GPIO_BASE BOARD_USDHC1_RESET_B_GPIO_BASE
#define BOARD_SD_RESET_B_GPIO_PIN BOARD_USDHC1_RESET_B_GPIO_PIN
#define BOARD_SD_RESET_B_GPIO_IOMUXC BOARD_USDHC1_RESET_B_GPIO_IOMUXC
#elif BL_FEATURE_SD_MODULE_PERIPHERAL_INSTANCE == 2
#define BOARD_SD_HOST_BASEADDR BOARD_USDHC2_BASEADDR
#define BOARD_SD_HOST_CLK_FREQ BOARD_USDHC2_CLK_FREQ
#define BOARD_SD_CD_GPIO_BASE BOARD_USDHC2_CD_GPIO_BASE
#define BOARD_SD_CD_GPIO_PIN BOARD_USDHC2_CD_GPIO_PIN
#define BOARD_SD_CD_GPIO_IOMUXC BOARD_USDHC2_CD_GPIO_IOMUXC
#define BOARD_SD_CMD_IOMUXC BOARD_USDHC2_CMD_IOMUXC
#define BOARD_SD_CLK_IOMUXC BOARD_USDHC2_CLK_IOMUXC
#define BOARD_SD_DATA0_IOMUXC BOARD_USDHC2_DATA0_IOMUXC
#define BOARD_SD_DATA1_IOMUXC BOARD_USDHC2_DATA1_IOMUXC
#define BOARD_SD_DATA2_IOMUXC BOARD_USDHC2_DATA2_IOMUXC
#define BOARD_SD_DATA3_IOMUXC BOARD_USDHC2_DATA3_IOMUXC
//#define BOARD_SD_VSELECT_IOMUXC BOARD_USDHC2_VSELECT_IOMUXC
#define BOARD_SD_RESET_B_GPIO_BASE BOARD_USDHC2_RESET_B_GPIO_BASE
#define BOARD_SD_RESET_B_GPIO_PIN BOARD_USDHC2_RESET_B_GPIO_PIN
#define BOARD_SD_RESET_B_GPIO_IOMUXC BOARD_USDHC2_RESET_B_GPIO_IOMUXC
#else
#define BOARD_SD_HOST_BASEADDR
#define BOARD_SD_HOST_CLK_FREQ
#define BOARD_SD_CD_GPIO_BASE
#define BOARD_SD_CD_GPIO_PIN
#define BOARD_SD_CD_GPIO_IOMUXC
#define BOARD_SD_CMD_IOMUXC
#define BOARD_SD_CLK_IOMUXC
#define BOARD_SD_DATA0_IOMUXC
#define BOARD_SD_DATA1_IOMUXC
#define BOARD_SD_DATA2_IOMUXC
#define BOARD_SD_DATA3_IOMUXC
#define BOARD_SD_VSELECT_IOMUXC
#define BOARD_SD_RESET_B_GPIO_BASE
#define BOARD_SD_RESET_B_GPIO_PIN
#define BOARD_SD_RESET_B_GPIO_IOMUXC
#endif

#define BOARD_SD_SUPPORT_180V (BL_FEATURE_SD_MODULE_SUPPORT_1V8)
////////////////////////////////////////////////////////////////////////////////
// Board FUNC Definitions
////////////////////////////////////////////////////////////////////////////////

