Masmiseim36/nxpSDK/middleware/mcu_bootloader/targets/MIMXRT1021/src/sdmmc_init.h
#if BL_FEATURE_SD_MODULE

/*! @brief SD power control init function. */
#define BOARD_USDHC_SDCARD_RESET_CONTROL_INIT(base) BOARD_USDHC_POWER_CONTROL_INIT(base)
/*! @brief SD power enable/disable function. */
#define BOARD_USDHC_SDCARD_RESET_CONTROL(base, state) BOARD_USDHC_POWER_CONTROL(base, state)
/*! @brief SD vselect init function. */
#define BOARD_USDHC_SDCARD_VSELECT_INIT(base) BOARD_USDHC_VSELECT_INIT(base)
/*! @brief SD power control init function. */
#define BOARD_USDHC_SDCARD_POWER_CONTROL_INIT()
/*! @brief SD power enable/disable function. */
#define BOARD_USDHC_SDCARD_POWER_CONTROL(state)

#define BOARD_SD_MUX_CONFIG(base, busWidth)                                                               \
    {                                                                                                     \
        switch (busWidth)                                                                                 \
        {                                                                                                 \
            case kSD_DataBusWidth4Bit:                                                                    \
                IOMUXC_SetPinMux(BOARD_SD_DATA1_IOMUXC, false);                                           \
                IOMUXC_SetPinMux(BOARD_SD_DATA2_IOMUXC, false);                                           \
                IOMUXC_SetPinMux(BOARD_SD_DATA3_IOMUXC, false);                                           \
                IOMUXC_SetPinConfig(BOARD_SD_DATA1_IOMUXC,                                                \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_SD_DATA2_IOMUXC,                                                \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_SD_DATA3_IOMUXC,                                                \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
            case kSD_DataBusWidth1Bit:                                                                    \
                IOMUXC_SetPinMux(BOARD_SD_CMD_IOMUXC, true);                                              \
                IOMUXC_SetPinMux(BOARD_SD_CLK_IOMUXC, false);                                             \
                IOMUXC_SetPinMux(BOARD_SD_DATA0_IOMUXC, false);                                           \
                IOMUXC_SetPinConfig(BOARD_SD_CMD_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_SD_CLK_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(1) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
                IOMUXC_SetPinConfig(BOARD_SD_DATA0_IOMUXC,                                                \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |     \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK | \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(2) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) |   \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(1));                                    \
        }                                                                                                 \
    }

#define BOARD_SD_PIN_CONFIG(speed, strength)

/* define for SD config IO driver strength dynamic */
#define BOARD_SD_IO_UPDATE(base, busWidth, speed, strength)                                                 \
    {                                                                                                       \
        switch (busWidth)                                                                                   \
        {                                                                                                   \
            case kSD_DataBusWidth4Bit:                                                                      \
                IOMUXC_SetPinConfig(BOARD_SD_DATA1_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_SD_DATA2_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_SD_DATA3_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
            case kSD_DataBusWidth1Bit:                                                                      \
                IOMUXC_SetPinConfig(BOARD_SD_CMD_IOMUXC,                                                    \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_SD_CLK_IOMUXC,                                                    \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
                IOMUXC_SetPinConfig(BOARD_SD_DATA0_IOMUXC,                                                  \
                                    IOMUXC_SW_PAD_CTL_PAD_SRE_MASK | IOMUXC_SW_PAD_CTL_PAD_PKE_MASK |       \
                                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK | IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |   \
                                        IOMUXC_SW_PAD_CTL_PAD_SPEED(speed) | IOMUXC_SW_PAD_CTL_PAD_PUS(1) | \
                                        IOMUXC_SW_PAD_CTL_PAD_DSE(strength));                               \
        }                                                                                                   \
    }
#else
#define BOARD_USDHC_SDCARD_POWER_CONTROL_INIT()
#define BOARD_USDHC_SDCARD_POWER_CONTROL(state)
#define BOARD_USDHC_SDCARD_VSELECT_INIT()
#define BOARD_SD_MUX_CONFIG(base, busWidth)
#define BOARD_SD_PIN_CONFIG(speed, strength)
#define BOARD_SD_IO_UPDATE(base, busWidth, speed, strength)
#endif

